app/controllers/breakouts_controller.rb

  def index
    render json: Breakout.all, root:false
---
SELECT "breakouts".* FROM "breakouts"