app/controllers/tips_controller.rb

  def index
    if params == nil
      render json: Tip.all, root:false
    elsif params[:breakout] == '0'
      render json: Tip.get_loose_tips, root: false
    else
      render json: Tip.find_by_breakout_id(params[:breakout]), root:false
---
SELECT  "tips".* FROM "tips"  WHERE "tips"."breakout_id" IS NULL LIMIT 1